final-versions/numbered/V0.0/benchmarks/k6-full-result-80-5-vus-800-2-workers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6_benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 800 max VUs, 10m30s max duration (incl. graceful stop):
              * exact_requests: 99000 iterations shared among 800 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 800/800 VUs, 307 complete and 0 interrupted iterations
exact_requests   [   0% ] 800 VUs  00m01.0s/10m0s  00307/99000 shared iters

running (00m02.0s), 800/800 VUs, 4570 complete and 0 interrupted iterations
exact_requests   [   5% ] 800 VUs  00m02.0s/10m0s  04570/99000 shared iters

running (00m03.0s), 800/800 VUs, 11942 complete and 0 interrupted iterations
exact_requests   [  12% ] 800 VUs  00m03.0s/10m0s  11942/99000 shared iters

running (00m04.0s), 800/800 VUs, 18137 complete and 0 interrupted iterations
exact_requests   [  18% ] 800 VUs  00m04.0s/10m0s  18137/99000 shared iters

running (00m05.0s), 800/800 VUs, 25185 complete and 0 interrupted iterations
exact_requests   [  25% ] 800 VUs  00m05.0s/10m0s  25185/99000 shared iters

running (00m06.0s), 800/800 VUs, 32638 complete and 0 interrupted iterations
exact_requests   [  33% ] 800 VUs  00m06.0s/10m0s  32638/99000 shared iters

running (00m07.0s), 800/800 VUs, 40228 complete and 0 interrupted iterations
exact_requests   [  41% ] 800 VUs  00m07.0s/10m0s  40228/99000 shared iters

running (00m08.0s), 800/800 VUs, 47560 complete and 0 interrupted iterations
exact_requests   [  48% ] 800 VUs  00m08.0s/10m0s  47560/99000 shared iters

running (00m09.0s), 800/800 VUs, 53757 complete and 0 interrupted iterations
exact_requests   [  54% ] 800 VUs  00m09.0s/10m0s  53757/99000 shared iters

running (00m10.0s), 800/800 VUs, 60676 complete and 0 interrupted iterations
exact_requests   [  61% ] 800 VUs  00m10.0s/10m0s  60676/99000 shared iters

running (00m11.0s), 800/800 VUs, 68260 complete and 0 interrupted iterations
exact_requests   [  69% ] 800 VUs  00m11.0s/10m0s  68260/99000 shared iters

running (00m12.0s), 800/800 VUs, 75433 complete and 0 interrupted iterations
exact_requests   [  76% ] 800 VUs  00m12.0s/10m0s  75433/99000 shared iters

running (00m13.0s), 800/800 VUs, 82966 complete and 0 interrupted iterations
exact_requests   [  84% ] 800 VUs  00m13.0s/10m0s  82966/99000 shared iters

running (00m14.0s), 800/800 VUs, 89634 complete and 0 interrupted iterations
exact_requests   [  91% ] 800 VUs  00m14.0s/10m0s  89634/99000 shared iters

running (00m15.0s), 800/800 VUs, 96054 complete and 0 interrupted iterations
exact_requests   [  97% ] 800 VUs  00m15.0s/10m0s  96054/99000 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 396000 25767.64721/s
    checks_succeeded...: 25.00% 99000 out of 396000
    checks_failed......: 75.00% 297000 out of 396000

    ✗ Success (200 OK)
      ↳  20% — ✓ 20000 / ✗ 79000
    ✗ Duplicate ID (409 Conflict)
      ↳  0% — ✓ 0 / ✗ 99000
    ✗ Sold Out (410 Gone)
      ↳  79% — ✓ 79000 / ✗ 20000
    ✗ Gateway/DB Error (500+)
      ↳  0% — ✓ 0 / ✗ 99000

    HTTP
    http_req_duration..............: avg=114.18ms min=89.17ms med=106.63ms max=3.66s p(90)=122.78ms p(95)=133.54ms
      { expected_response:true }...: avg=126.98ms min=96.23ms med=113.46ms max=3.66s p(90)=130.54ms p(95)=146.73ms
    http_req_failed................: 79.87% 79397 out of 99397
    http_reqs......................: 99397  6467.74452/s

    EXECUTION
    iteration_duration.............: avg=122.82ms min=89.29ms med=106.97ms max=4.07s p(90)=123.37ms p(95)=134.86ms
    iterations.....................: 99000  6441.911803/s
    vus............................: 800    min=800            max=800
    vus_max........................: 800    min=800            max=800

    NETWORK
    data_received..................: 22 MB  1.4 MB/s
    data_sent......................: 11 MB  685 kB/s



running (00m15.4s), 000/800 VUs, 99000 complete and 0 interrupted iterations
exact_requests ✓ [ 100% ] 800 VUs  00m15.4s/10m0s  99000/99000 shared iters